import{_ as e,c as t,j as a,a as s,o as l}from"./chunks/framework.BUevxtdZ.js";const f=JSON.parse('{"title":"Датапаки","description":"Датапаки Кошкокрафта","frontmatter":{"icon":"octicons/tools-16","description":"Датапаки Кошкокрафта"},"headers":[],"relativePath":"gameplay/unique/datapacks.md","filePath":"gameplay/unique/datapacks.md","lastUpdated":1732143786000}'),p={name:"gameplay/unique/datapacks.md"};function r(d,n,o,c,i,u){return l(),t("div",null,n[0]||(n[0]=[a("h1",{id:"датапаки",tabindex:"-1"},[s("Датапаки "),a("a",{class:"header-anchor",href:"#датапаки","aria-label":'Permalink to "Датапаки"'},"​")],-1),a("p",null,"Для разнообразия геймплея, мы добавили несколько датапаков!",-1),a("p",null,"Генерация мира, новые достижения, новая высота мира и прочее...",-1),a("p",null,'!!! example "Датапаки на генерацию мира"',-1),a("pre",null,[a("code",null,`=== "Структуры"
    На сервере стоит 7 датапаков, добавляющие новые структуры и **слегка** изменяющие генерацию!

    Новые порталы в Ад, случайные постройки, поваленные деревья и многое-многое другое...

    !!! success ""
        Все они выглядят ванильно и вписываются в стилистику игры!

=== "Высота мира"
    Благодаря датапаку, высота мира теперь целых **1024 блока**!

    Строй сколько тебе душе угодно!
`)],-1),a("p",null,'!!! example "Геймплейные датапаки"',-1),a("pre",null,[a("code",null,`=== "BlazeAndCaves"
    Самый популярный датапак, добавляющий **1000+** достижений различной тематики и сложности! От крафта лодки и палки до **убийства дракона, визера и окончания рейда одновременно за 30 секунд**! Благодаря нему тебе точно будет чем заняться!

=== "Кошкокрафт"
    Наш личный датапак на серверные достижения. Есть и забавные, по типу **Подари админу цветок** или **Получи командный блок по ошибке**, есть достижения обучения, по типу **Пополни свой счёт** или **Выполни хотя бы один квест Бармена**.

=== "<span id="my-text">Котячьи заслуги</span>"
    Наша уникальная разработка - система поощрений игроков за приглашенных друзей, красивые постройки, идеи, скриншоты и прочее! Подробнее об этой системе можно узнать в статье [Котячьи заслуги](../rewards/catpass.md).

=== "ChestUpdate"
    Открыв натурально-сгенерированный сундук с лутом он восстановится рандомно в течении двух недель (если не был сломан).

    Это убирает приемущество "старичков" над новичками, позволяя всем получить ванильный *или редкий* лут!

=== "MC Paint"
    Невероятный датапак, дающий возможность рисовать картины на холстах!

    Подробнее [тут](/gameplay/unique/artmap/)
`)],-1)]))}const _=e(p,[["render",r]]);export{f as __pageData,_ as default};
