import{_ as t,c as n,ac as o,o as r}from"./chunks/framework.BUevxtdZ.js";const g=JSON.parse('{"title":"Ультимативный гайд по Президенству","description":"Гайд по работе Президента","frontmatter":{"hide":["navigation","footer","path"],"search":{"exclude":true},"description":"Гайд по работе Президента"},"headers":[],"relativePath":"guides/work/president_guide.md","filePath":"guides/work/president_guide.md","lastUpdated":1732143786000}'),a={name:"guides/work/president_guide.md"};function i(d,e,s,p,u,c){return r(),n("div",null,e[0]||(e[0]=[o(`<h1 id="ультимативныи-гаид-по-президенству" tabindex="-1">Ультимативный гайд по Президенству <a class="header-anchor" href="#ультимативныи-гаид-по-президенству" aria-label="Permalink to &quot;Ультимативный гайд по Президенству&quot;">​</a></h1><p>!!! warning &quot;Недоделанный гайд&quot; Гайд написан кратко, многое отсутствует.</p><p>Привет! Это гайд по Президенству на Кошкокрафте. Тут <strong>не будет</strong> описано как тебе <strong>точнено</strong> работать - это твоя задача придумать хорошую структуру и развивать нашу страну!</p><p>В этом гайде я просто опишу пару советов, какие команды тебе доступны и что <strong>в целом</strong> тебе надобно делать.</p><p>!!! tip &quot;Советы от бывших Президентов&quot; === &quot;TOMMY_WERSETY&quot; 1. Не пытайся прыгнуть выше головы. Никогда.</p><pre><code>    2. Прежде чем принимать решение, подумай **дважды** о последствиях (даже если на тебя очень давят).

    3. Не обещай слишком много.

    4. Если чувствуешь, что не вывозишь - отдохни, займись своими делами. Вне зависимости от того, что говорят люди - отдых должен быть всегда.

    5. Не бери все задачи на себя - у тебя есть (или должны быть) подчинённые, и при грамотном распределении дел можно всего лишь контроллировать их работу.

    6. Народ стоит слушать, но он не всегда бывает прав. Имей свою голову на плечах, или в крайнем случае спрашивай у прошлых президентов и премьер-министров.

=== &quot;Magistr&quot;
    1. Будь крутым президентом, делай ивенты, делай конкурсы, у тебя есть власть и средства, просто возьмись.

    2. Не забивай свою голову другими делами, взялся за пост - не стой афк, работай, делай посты, хотя бы 1 в два дня, это уже будет не афк.

    3. Слушай других людей, они помогут и подскажут, заведи друзей, которые будут тебя поддерживать и просто будь крутышкой!

=== &quot;Szarkan&quot;
    1. Не принимай всё близко к сердцу. Да, игроки могут быть **по-настоящему** недовольно и реально оскорблять, но в конечном итоге это всё игра. Будь ответственным, но старайся не впитывать в себя весь негатив.

    2. **ХОТЯ БЫ** делай вид, что что-то делаешь. Отсутствие постов, активности, новостей - ранние признаки грядущих перевыборов. Есть какой-то закон на уме? Сделай пост. Что-то строишь? Сделай пост. Хочешь получить фидбек граждан? Сделай пост!

    3. Не делай ивенты, которые портят жизнь **всем**. Пример - скалк-вирус, типа как на МШ, где игроки заражают друг друга, и от заражения на тебя накладываются дебаффы. Не все хотят учавствовать в ивентах, и это нормально.
</code></pre><h2 id="твои-команды" tabindex="-1">Твои команды <a class="header-anchor" href="#твои-команды" aria-label="Permalink to &quot;Твои команды&quot;">​</a></h2><p>!!! tip &quot;&quot; ### В игре</p><pre><code>\`/police add &lt;ник&gt;\` - добавить полицейского

\`/police remove &lt;ник&gt;\` - уволить полицейского

\`@everyone\` - пингануть всех **на сервере**

### В дискорде

\`/giverole &lt;ник&gt; &lt;роль&gt;\` - выдать роль в Дискорде

Также ты можешь смотреть и писать в репортах, имеешь доступ к чатам Правительства и КСБ.
</code></pre>`,9)]))}const q=t(a,[["render",i]]);export{g as __pageData,q as default};
