import{_ as e,c as a,ac as t,o}from"./chunks/framework.BUevxtdZ.js";const q=JSON.parse('{"title":"Какой лаунчер выбрать для игры?","description":"Какой лаунчер выбрать для Майнкрафта?","frontmatter":{"toc_depth":2,"description":"Какой лаунчер выбрать для Майнкрафта?"},"headers":[],"relativePath":"guides/other/launcher.md","filePath":"guides/other/launcher.md","lastUpdated":1732143786000}'),r={name:"guides/other/launcher.md"};function u(c,n,d,l,h,i){return o(),a("div",null,n[0]||(n[0]=[t(`<h1 id="какои-лаунчер-выбрать-для-игры" tabindex="-1">Какой лаунчер выбрать для игры? <a class="header-anchor" href="#какои-лаунчер-выбрать-для-игры" aria-label="Permalink to &quot;Какой лаунчер выбрать для игры?&quot;">​</a></h1><p>Выбор хорошего лаунчера довольно таки сложная задача. Здесь я проведу вас по самым популярным - для пираток и лицензий.</p><h2 id="если-ты-пират" tabindex="-1">Если ты - пират <a class="header-anchor" href="#если-ты-пират" aria-label="Permalink to &quot;Если ты - пират&quot;">​</a></h2><p>Никого не осуждаем =)</p><p>!!! example &quot;&quot;</p><pre><code>=== &quot;TLauncher&quot;
    Самый популярный среди пиратов лаунчер. К сожалению.

    !!! warning &quot;&quot;
        Если что-то не работает на сервере, и ты играешь через ТЛаунчер - это и есть причина в 90% случаев

    ### Плюсы:

    - Он работает

    - Есть *кривая* система мод-паков

    ### Минусы:

    - Их собственная система скинов ломает все скины впринципе. Из-за лаунчера не видны скины с других лаунчеров или скины лицензионных игроков.

    - Тотальная неоптимизация, замедляющая всю игру. Да, лаунчер напрямую влияет на производительность игры.

    - Отвратительная система мод-паков, которая скачивает моды с устаревшего CurseForge.

    - Известны случаи воровства данных.

    - **КУЧА. БЛЯДСКОЙ. РЕКЛАМЫ. ВЕЗДЕ.**

    - Их античит выключается только за деньги. А цель античита - неизвестна.

    - Закрытый код, они могут напихать туда что-угодно.

    ![tlauncher_kall](/assets/guides/launcher/tlauncher.jpg){ width=50% decoding=&quot;async&quot; loading=&quot;lazy&quot; }

=== &quot;KLauncher&quot;
    Новый, красивый лаунчер, &quot;убийца&quot; Tlauncher. 

    ### Плюсы:

    - Красивый интерфейс

    - Он работает

    - Есть система мод-паков

    ### Минусы:

    - Идентичны из минусов TLauncher

    - Неоптимизированный код

    - Куча рекламы (даже при скачивании самого лаунчера!)

    - Своя система скинов, ломающая все остальные

    - Микротранзакции

    - Трояны ([источник](https://www.youtube.com/watch?v=tKrq4oojoEw&amp;ab_channel=%D0%9D%D0%B4%D0%B5%D0%BD%D0%B4%D0%B5%D0%BD%D0%B0))

    - Закрытый код

    ![klauncher_kall](/assets/guides/launcher/klauncher.jpg){ width=50% decoding=&quot;async&quot; loading=&quot;lazy&quot; }

=== &quot;Legacy Launcher (бывший TL)&quot;
    Оригинальный TLauncher, ранее назывался просто TL. Объективно - **лучший вариант**.

    ### Плюсы:

    - Ничего не намешано - выбрал версию, ник и играешь

    - Очень мало рекламы - один баннер на главной странице

    - Добавление рекламных серверов в список серверов в игре можно отключить. Бесплатно!

    - Хорошая оптимизация

    - Можно выбрать систему скинов, обе из которых ничего не ломают!

    ### Минусы:

    - Нет системы создания Мод-паков

    - Скучный интерфейс

    - Закрытый код

    ![legacy launcher good](/assets/guides/launcher/legacy.jpg){ width=50% decoding=&quot;async&quot; loading=&quot;lazy&quot; }
</code></pre><h2 id="если-у-тебя-лицензия" tabindex="-1">Если у тебя - лицензия <a class="header-anchor" href="#если-у-тебя-лицензия" aria-label="Permalink to &quot;Если у тебя - лицензия&quot;">​</a></h2><p>!!! example &quot;&quot;</p><pre><code>=== &quot;MultiMC&quot;
    
    Очень хороший лаунчер, позволяющий создавать тысячи сборок, и настраивать их на свой вкус!

    ### Плюсы:

    - Система мод-паков - можно скачать готовые сборки из CurseForge, Modrinth и ATP

    - В самом лаунчере можно просмотреть миры, скриншоты, список модов, сервера и настройки отдельной сборки

    - Можно добавлять несколько аккаунтов

    - НОЛЬ рекламы

    - Всё бесплатно

    - Открытый исходный код

    ### Минусы:

    - Сложный интерфейс - можно запутаться

    - Довольно долгая загрузка самой игры

=== &quot;Modrinth App&quot;

    Новый лаунчер от сайта Modrinth - сайта с модами для Майнкрафт!

    ### Плюсы:

    - Можно создавать сборки, выбирая моды прямо в лаунчере

    - Моды берутся с сайта Modrinth

        - Убийца CurseForge, намного удобнее и красивее

    - Свою сборку можно настроить как-угодно

    - Красивый и интуитивный интерфейс

    - Можно добавить несколько аккаунтов

    - Игра быстро запускается

    - Моды в сборке обновляются автоматически и скачиваются из первоисточника

    - Сборку можно запаковать в удобный файл формата .mrpack

    - Открытый исходный код

    ### Минусы:

    - Прямо в лаунчере можно скачать моды лишь с Modrinth, из других источников нужно ручками

    - Есть немного рекламы в самом лаунчере

    - Новые снапшоты появляются лишь через пару дней после их выхода
</code></pre>`,9)]))}const p=e(r,[["render",u]]);export{q as __pageData,p as default};
