import{_ as s,c as t,j as n,a,o}from"./chunks/framework.BUevxtdZ.js";const u=JSON.parse('{"title":"Словарик сервера","description":"Словарик сервера","frontmatter":{"icon":"octicons/info-16","description":"Словарик сервера"},"headers":[],"relativePath":"info/dict.md","filePath":"info/dict.md","lastUpdated":1732143786000}'),r={name:"info/dict.md"};function l(c,e,d,i,p,f){return o(),t("div",null,e[0]||(e[0]=[n("h1",{id:"словарик-сервера",tabindex:"-1"},[a("Словарик сервера "),n("a",{class:"header-anchor",href:"#словарик-сервера","aria-label":'Permalink to "Словарик сервера"'},"​")],-1),n("p",null,[a('!!! tip "" - '),n("strong",null,"АР"),a(" - валюта сервера, "),n("strong",null,"глубиносланцевая"),a(" алмазная руда, выглядит как золотая монетка, если включен ресурспак.")],-1),n("pre",null,[n("code",null,`- **ОАР** - **обычная** алмазная руда, выглядит как алмазная монетка, если включен ресурспак<br>
Можно обменять на **АРы** по курсу \`1 ОАР = 5 АРов\`

- **КК** - **К**ошко**К**рафт, сокращение названия сервера

- **Всекотец** - основатель сервера, **Szarkan**, Серёжа Котиков

- <span class="neon bold">Котик+</span> - или К+, привелегия. Подробнее - [Донатик](donate.md).

- **Всекот(*ёнок*)** - админ сервера

- **TPS** - Ticks Per Second, "скорость" работы сервера.
    
    - <span class="green">20 ТПС</span> - идеальное значение

    - <span class="gold">15 ТПС</span> - чувствуются лаги

    - <span class="red">10 ТПС</span> - игра в два раза медленнее, очень сильные лаги

- **Гыча мафон** - сервер в марте хызьма гном клюв. Старый локальный мем, смысла в нём нет.

- **Гном** - зачастую, оскорбление.

- **1 правило** - обычно подразумевается правило об общении игроков

- **Правила** - внеигровые правила сервера, отслеживаются администрацией.

- **Законы** - игровые правила сервера, по большей части отслеживаются полицией.

- **Котята/котёнок/котик** - в контекте новостей и данной Вики - игрок(и) сервера

- **Офицер КСБ/Полискет** - сотрудник правоохранительных служб

- **РП** - РолПлей (*Roleplay*) - отыгрыш персонажа

- **Внешний мир** - РП обозначения **настоящего** мира, где живут люди

- **Потеря благословления** - очень плохая вещь. Не советуем.
`)],-1)]))}const _=s(r,[["render",l]]);export{u as __pageData,_ as default};
